[Reference](https://python.plainenglish.io/how-to-convert-list-to-string-in-python-7bc091cf46df)

In [1]:
list1 = ['1', '2', '3', '4', '5']
str1 = ''.join(list1)
print(str1)

12345

In [2]:
list1 = [1, 2, 12, 6, 'ABC']

SyntaxError: ignored

In [4]:
list1 = [1, 2, 12, 6, 'ABC']
str1 = ','.join([str(x) for x in list1])
str2 = ', '.join(map(str, list1))
print(str1)
print(str2)

1,2,12,6,ABC
1, 2, 12, 6, ABC

In [6]:
import pandas as pd
# initialize list of lists 
data = [['tom', ['comment1', 'comment2']], ['nick', ['comment3', 'comment4']], ['juli', []]] 
  
# Create the pandas DataFrame 
df = pd.DataFrame(data, columns = ['Name', 'Comments']) 
df

   Name              Comments
0   tom  [comment1, comment2]
1  nick  [comment3, comment4]
2  juli                    []

In [7]:
df['new_comments'] = df['Comments'].apply('. '.join)

In [8]:
df

   Name              Comments        new_comments
0   tom  [comment1, comment2]  comment1. comment2
1  nick  [comment3, comment4]  comment3. comment4
2  juli                    []